//=====================================================================
//   15988번:    1, 2, 3 더하기 3                   
//   @date:   2024-12-19              
//   @link:   https://www.acmicpc.net/problem/15988  
//   @Motd:   폴더 내부에 있는 파일을 삭제하거나 변경하지 말아주세요.
//   @Test:   코드를 작성 후 "BOJ: 테스트"통해서 테스트를 해보세요.
//=====================================================================

#include <iostream>
using namespace std;

int arr[1000002] = {1,1,2,};

int main() {
  int t;
	cin >> t;

  for(int i=3;i<1000001;i++) {
    arr[i] = ((arr[i-1]+arr[i-2]) % 1000000009 + arr[i-3]) % 1000000009;
  }

  while(t--) {
    int n;
    cin >> n;
    cout << arr[n] << '\n';
  }
  return 0;
}
